{"timestamp":"2021-09-30T17:00:02.805891168-05:00","content":{"locations":[{"whereToGo":"View splashes of soft yellows and oranges mixed with green trees across the valley as you explore the Glacial Potholes Area or hike the Walter F. Mondale River Trail. Or, hike the more rugged Sandstone Bluffs Trail where the maples are just beginning to turn color.","url":"/state_parks/interstate","name":"Interstate","whatToSee":"Trails within the park still have lots of green, but the surrounding river valley is becoming more colorful by the day. Hackberry, ironwood and basswood trees are adding soft yellows, maples are adding soft oranges, and a few oaks are just beginning to turn a russet red. Some ash trees have already lost their leaves.","grasses":"3","leaves":"4","lon":-92.661633,"id":"SPK00178","photo":"1632928831432","date":"September 30, 2021","region":"metro","flowers":"6","lat":45.395314,"timestamp":"2021-09-30 16:11:39","alsoOfInterest":"<p>Visit the park's webpage for details about park programs this weekend.</p>\n\n<p>This park can be very busy on nice fall weekends, with parking lots sometimes filling by noon. Visit on a weekday or before noon on weekends for a quieter experience. If you plan to hike the Walter F. Mondale River Trail or the Railroad Trail, you may wish to park at the campground/canoe launch entrance of the park where there is more available parking on weekends.  </p>\n\n<p> Strollers do not work well on most of the park's trails due to uneven terrain and stairs.</p> "},{"whatToSee":"Most species of trees have begun to change colors, some spectacularly.  Many trees lost leaves early because of the drought. A wide variety of mushrooms are also popping up after recent rains. ","url":"/state_parks/charles_a_lindbergh","whereToGo":"Some of the best color in the park is in the campground, which has closed for the season, effectively making those roads  paved hiking trails.  Visitors should use caution around any construction activity they encounter.\n\nThe short section of the Camp Ripley Veteran's State Trail in the park still has nice patches of brown-eyed susans and asters blooming.","name":"Charles A. Lindbergh","leaves":"3","grasses":"3","lon":-94.377834,"date":"September 30, 2021","photo":"1632420376110","region":"nw","id":"SPK00136","flowers":"6","lat":45.980664,"timestamp":"2021-09-30 16:09:34","alsoOfInterest":"The Charles Lindbergh Home and Museum, operated by the Minnesota Historical Society, is closed for the season.\n\nThe Charles A. Weyerhaeuser Museum, operated by the Morrison County Historical Society, is located on County Road 52 across from the park.   The free museum is closed during October for renovations.  "},{"timestamp":"2021-09-30 15:49:58","lat":45.567979,"alsoOfInterest":"Trails are a welcome place for hikers and leaf peepers now as they provide a pathway along the rivers and through brilliant maples at the park. Check out the park trail guide on the park?s trail section web page for mileage and difficulty or pick one up at the ranger station when entering the park. Paddling the St. Croix River is a great way to see the fall colors too. Local outfitters provide some shuttle options. There is no canoe vendor at the park at this time.","leaves":"4","grasses":"5","url":"/state_parks/wild_river","name":"Wild River","whereToGo":"Pops of reds and golds are quite beautiful looking off of the Visitor Center deck. The drive along the main park road heading to the picnic shelter or campground also provide a golden curtain along your route. An early morning drive is best to see the sun shining through the leaves. I hike along the Walter F. Mondale River Trail also lets you see the color mosaic along the river on the Wisconsin side of the St. Croix. Also check out the maples on the Highland Hills loop behind the park office.","whatToSee":"The greens are quickly disappearing with many leaves curling and dropping before showing their full colors. Leaves are lightening in color to yellows in places with openings in the woods to reveal the understory of the forests. The prairies appear at their peak, with seed heads for many species showing their final flair before moving on to the next stage. Dark reds of sumac, Virginia creeper and even poison ivy are adding to the canvas in the lower woodland landscape. Maples throughout the park are turning yellows, oranges and reds, while the oaks are still in the green stages and turn later as usual.","flowers":"6","lon":-92.808965,"photo":"1632862784976","date":"September 30, 2021","id":"SPK00254","region":"metro"},{"grasses":"4","leaves":"3","whereToGo":"Just before the foot bridge to the Devils Kettle trail, go right and fallow the trail down stream. Its a Short walk but worth it. Particularly if you like Bird watching.","url":"/state_parks/judge_cr_magney","whatToSee":"The aspens and the birch are still mostly green with a few starting to turn color. Ash, hazel Brush, mountain ash, and moose maple have the real color right now varying in shades from yellow to orange and red. The Under growth is also turning from green to a variety of colors ranging from brown, yellow, red and purple.\nHigh bush Cranberry, Mountain Ash, and rose hips are all ripe adding splashes of red to the landscape. ","name":"Judge C.R. Magney","flowers":"6","lon":-90.075117,"date":"September 30, 2021","photo":"1632930754605","id":"SPK00193","region":"ne","timestamp":"2021-09-30 13:24:08","lat":47.850584,"alsoOfInterest":"The fall colors get better the further inland you go. \nAlso Pink Salmon are running in the Brule River."},{"flowers":"0","lon":-93.999582,"photo":"1632770329072","date":"September 30, 2021","id":"SRA00302","region":"nw","grasses":"0","leaves":"3","name":"Cuyuna Country","url":"/state_parks/cuyuna_country","whereToGo":"Miners Mountain Overlook is the best place in the surrounding area for views from 200 feet above the surrounding area.  Pennington Boat Launch is also a favorite fall color and photography spot, especially in the morning.        ","whatToSee":"Sumacs are losing their deep red leaves quickly.  A random pop of deep red and orange from oaks and maples are becoming visible. Vibrant gold cottonwoods, aspen and birch are dotted throughout the landscape.  ","alsoOfInterest":"","timestamp":"2021-09-30 11:24:35","lat":46.478466},{"photo":"1633018309593","date":"September 30, 2021","region":"nw","id":"SPK00139","lon":-94.334502,"flowers":"3","url":"/state_parks/crow_wing","whereToGo":"Crow Wing State Park is starting to show signs that fall is fast approaching.","name":"Crow Wing","whatToSee":"","grasses":"3","leaves":"3","alsoOfInterest":"","lat":46.290519,"timestamp":"2021-09-30 11:12:30"},{"leaves":"4","grasses":"5","url":"/state_parks/myre_big_island","whatToSee":"You will see a variety of migrating birds in addition to colorful Fall foliage.  ","name":"Myre-Big Island","whereToGo":"Park in the Great Marsh parking area and take a hike around the marsh.  \n\n\n","flowers":"5","lon":-93.297734,"photo":"1632940303653","id":"SPK00175","date":"September 30, 2021","region":"se","timestamp":"2021-09-30 09:03:25","lat":43.6384,"alsoOfInterest":"Albert Lea Lake is a great vantage point for leaf-peeping along the shoreline.  \n\nRent a canoe or kayak during office hours to take in the sights from the water."},{"date":"September 30, 2021","photo":"1632799468627","region":"ne","id":"SPK00262","lon":-93.565257,"flowers":"5","whereToGo":"The Fire Tower Trail will bring you through old growth timber with hues of browns and soft yellows throughout. Additionally, our hiking club trail consists of Chase Point Trail and the Tell Lake Trail loop. Both perfect to take in the scenery that Scenic State Park has to offer. ","url":"/state_parks/scenic","name":"Scenic","whatToSee":"Aspens are coming in with a golden yellow, while the maples are starting to get past peak. Leaves are falling fast and some trees are already looking bare for the year. ","leaves":"5","grasses":"5","alsoOfInterest":"","lat":47.715179,"timestamp":"2021-09-30 08:39:04"},{"lat":47.223451,"timestamp":"2021-09-30 07:29:41","alsoOfInterest":"Water and a rustic toilets are available year-round in the picnic grounds. ","whatToSee":"The deciduous trees are changing quickly, but their color doesn't seem to last long. It's a beautiful drive to and from the park these days! The fall wildflowers that you'll see, including woodland sunflower, a variety of asters, and goldenrod are sparse this year and all that we expect to see under the thick tree canopy. The deer are foraging in nearby fields, the squirrels are stashing acorns and the river is busy with wildlife activity.","url":"/state_parks/schoolcraft","name":"Schoolcraft","whereToGo":"Schoolcraft State Park is a quaint place off the beaten road, but nestled among the wild Mississippi River. A 2-mile hiking trail will take you around the entire perimeter; through stands of old-growth red and white pines, open oak groves and aside river marshes alive with migrating birds. The campground is closed for the season, but the picnic grounds and boat access sites are great places to unwind.","grasses":"5","leaves":"5","lon":-93.801627,"photo":"1633004897097","id":"SPK00263","date":"September 30, 2021","region":"ne","flowers":"5"},{"flowers":"4","date":"September 30, 2021","photo":"1632936463776","region":"se","id":"SPK00112","lon":-91.5728,"leaves":"3","grasses":"4","url":"/state_parks/beaver_creek_valley","name":"Beaver Creek Valley","whereToGo":"Follow the Beaver Creek Trail west across the pedestrian hiking bridge. This trail follows the stream for 1.5 miles. ","whatToSee":"There is a lot of color in the valley but not outside the park. Color in the valley is farther along than on top of the hills. Maple, basswood and walnut are already dropping some of their leaves.","alsoOfInterest":"Hike the Switchback and Hole in the Rock Trails for scenic overlooks of the valley.","timestamp":"2021-09-30 06:27:17","lat":43.649825},{"alsoOfInterest":"Take a selfie at the Selfie station on the South Overlook and come early morning for amazing sunrises.","timestamp":"2021-09-30 06:25:33","lat":43.942293,"flowers":"4","photo":"1632757326305","date":"September 30, 2021","region":"se","id":"SPK00244","lon":-91.397815,"leaves":"3","grasses":"4","url":"/state_parks/great_river_bluffs","name":"Great River Bluffs","whereToGo":"Hike out to King's Bluff to see views of the Mississippi River and surrounding bluffs. ","whatToSee":"Maple, walnut and aspen leaves are turning. There are spots of color throughout the bluffs."},{"flowers":"0","lon":-93.952913,"date":"September 29, 2021","region":"metro","id":"SPK00217","grasses":"0","leaves":"3","whereToGo":"Maples are starting to turn.","url":"/state_parks/lake_maria","name":"Lake Maria","whatToSee":"","alsoOfInterest":"","timestamp":"2021-09-29 16:16:05","lat":45.313935},{"leaves":"5","grasses":"6","url":"/state_parks/cascade_river","whatToSee":"This year's historic drought has caused many of the trees to lose their leaves early and forest ground covers to die back. Maples are turning orange and birch which haven't shed their leaves due to stress are turning yellow. Large leaf asters and pearly everlasting are almost done blooming and bush honeysuckle is turning red.","name":"Cascade River","whereToGo":"The highlight of the park is the Cascade River. Even with lower water this year due to the drought it's worth the hike from The Cascades down to Cascade Falls and back. It is about .5 miles to hike it as a loop.","flowers":"6","id":"SPK00133","photo":"1632326609475","date":"September 29, 2021","region":"ne","lon":-90.505568,"timestamp":"2021-09-29 15:47:53","lat":47.710148,"alsoOfInterest":"Cool, calm weather this week means the colors are still evolving and getting better each day.\nOn your way up to Cascade River take a drive up the Caribou Trail in Lutsen to see the maple ridges which are at peak color this week. Not as bright as many years but still a lot of beauty."},{"region":"se","photo":"1632943160353","date":"September 29, 2021","id":"SPK00250","lon":-93.057257,"flowers":"6","whereToGo":"Check out our pier/observation platform in the picnic area, which gives a great view of changing colors along the lakeshore.","url":"/state_parks/rice_lake","whatToSee":"<p><b>Leaves:</b>  Ash are peaking and many leaves have fallen.  Some maples are starting to add color, and aspens and oaks have just started to turn.</p>","name":"Rice Lake","grasses":"6","leaves":"3","alsoOfInterest":"<p>The lake is low, and access by canoe or kayak is a bit more challenging than normal.</p>\n\n<p>Waterfowl season is in full swing, and despite low water levels, opening weekend saw a reasonably good harvest.</p>\n\n<p>While hunting is NOT allowed in state parks, waterfowl hunting is allowed ON Rice Lake.  Please be aware that you may hear gunshots on the lake.  If you have questions, please call the park office at 507/414-6191.</p>","lat":44.088172,"timestamp":"2021-09-29 14:24:55"},{"alsoOfInterest":"Grab your fishing pole and try your luck at one of the park's fishing piers. Hint: the pier before the park office seems to give visitors the best experience. ","timestamp":"2021-09-29 13:53:09","lat":46.144515,"flowers":"4","lon":-93.492493,"photo":"1632938582024","id":"SPK00142","date":"September 29, 2021","region":"ne","grasses":"4","leaves":"4","whatToSee":"The forest is about half green. Changes are occurring here and there, including pops of color from maples and birch trees.   ","url":"/state_parks/father_hennepin","whereToGo":"Take a stroll along the beach trail to see Mille Lacs Lake up close. ","name":"Father Hennepin"},{"region":"se","photo":"1632940775285","date":"September 29, 2021","id":"SPK00160","lon":-92.363014,"flowers":"5","whatToSee":"Ash has turned bright yellow and sumac is showing a ride range of colors, ranging from green to deep purple. The forests are beginning to be mottled with color, mostly yellows but with a few oranges and reds peeking through.","url":"/state_parks/frontenac","name":"Frontenac","whereToGo":"Head to the prairie loop across County 2 from the office or the bluff prairie behind the campground.","grasses":"5","leaves":"3","alsoOfInterest":"New England Asters and Snakeroot are adding splashes of purple and white to the prairies.","lat":44.520881,"timestamp":"2021-09-29 13:42:40"},{"lat":44.860397,"timestamp":"2021-09-29 13:12:44","alsoOfInterest":"American White Pelicans are on the move, and some stragglers can still be seen on the Minnesota River.","whereToGo":"Small changes are afoot along the Minnehaha Trail as Virginia Creeper climbs the trees and brings a dash of red to the canopy. The sumac is also an early pop of color, as most other leaves remain a bright yellow-green.","url":"/state_parks/fort_snelling","name":"Fort Snelling","whatToSee":"White-tailed deer have shed their velvet and are more present as the morning stays dark longer and light fades earlier in the evening. The sun has a particularly striking golden hue these days!","grasses":"3","leaves":"2","date":"September 29, 2021","photo":"1632848070960","id":"SPK00154","region":"metro","lon":-93.189473,"flowers":"4"},{"lat":45.992648,"timestamp":"2021-09-29 13:01:04","alsoOfInterest":"Hidden Lake, Red Oak, and Maple-Basswood hiking trails are always a popular hike through the woods.  Mature Basswood, Maple and Oak trees will provide the bulk of the color later this fall so check back.  We are trending towards a October 2nd peak color weekend.  \n\nInterested in programs?  Check out the program and events calendar to see what is happening this week. ","whereToGo":"The color is changing quickly in the last week.  We are approaching peak so come enjoy while you can as it may be short lived.  The edges of the lake, roads, and use areas have the best color.\n\nDrive or walk the main paved park road to the beach.  If you wish to continue your adventure walk the Hidden Lake Trail, where the best color is in the use areas and along the lake. ","url":"/state_parks/lake_carlos","whatToSee":"The Sugar Maples are really changed this week along the edges of the lake and roads. They are providing some nice sprinkles of oranges and reds along with the sumac. The Ash and Basswood trees have reached peak color and starting to loose their leaves, but are still providing lots of yellow color around the park as well. ","name":"Lake Carlos","grasses":"5","leaves":"4","id":"SPK00211","photo":"1633010308015","date":"September 29, 2021","region":"nw","lon":-95.338506,"flowers":"6"},{"lat":48.007538,"timestamp":"2021-09-29 12:46:55","alsoOfInterest":"A .75 mile hike on the first section of the Middle Falls Trail includes a rocky 300-foot ascent to an overlook area with vistas of Lake Superior, the Pigeon River, and the cliffs and highlands on the Canadian side of the river. ","whereToGo":"High Falls Trail","url":"/state_parks/grand_portage","name":"Grand Portage","whatToSee":"Although the main fall color show is taking place inland from Lake Superior right now, the birch and aspen on the path to the High Falls are starting to display some yellow. The slender mountain maples and ground foliage are at their peak.","leaves":"4","grasses":"6","photo":"1632937894689","id":"SPK00173","date":"September 29, 2021","region":"ne","lon":-89.601983,"flowers":"6"},{"timestamp":"2021-09-29 12:26:23","lat":45.529473,"alsoOfInterest":"Canoe, kayaks, rowboats, and stand up paddle board rentals are still available on a first-come, first-served basis! If want to go fishing but you forgot your fishing pole, come to the office and rent one out for FREE!  Or come to the park and rent out a GPS unit to try out geocaching, or check out a birding kit to see and identify what birds are in the park!\n","leaves":"3","grasses":"4","url":"/state_parks/glacial_lakes","whatToSee":"Horse trails: The vast open prairie, and hike over the rolling hills.\n\nHigh Peak trail: Hike through an Oak Savannah heading to the highest peak in the park to overlook the vast rolling prairie.\n\nMarty's Trail: Head around the lake for a chance to see some wildlife, such as turtles, deer, and a variety birds! \n","name":"Glacial Lakes","whereToGo":"Check out one of the main vistas in the park and enjoy the scenery.  For a good mix of forest and prairie color, hit the High Peak Trail.  If you want complete prairie head to the horse camp, and head out on any of the horse trails to enjoy the color and sway of the grasses in the breeze. If you want to view the crystal clear spring fed lake, go on to the day use area and relax on the fishing pier, where you might get a fun view of our resident snapping turtles! ","flowers":"4","lon":-95.505711,"id":"SPK00166","photo":"1632270102549","date":"September 29, 2021","region":"nw"},{"alsoOfInterest":"The Des Moines River valley is a key fly way for many species of birds; make sure to keep a keen eye and a sharp ear out to catch a glimpse of some unique birds that also visit Kilen Woods State Park.","timestamp":"2021-09-29 11:56:37","lat":43.736496,"flowers":"4","date":"September 29, 2021","photo":"1630595159273","id":"SPK00196","region":"sw","lon":-95.069911,"grasses":"4","leaves":"3","name":"Kilen Woods","url":"/state_parks/kilen_woods","whatToSee":"Kilen Woods has many opportunities to see a diverse community of plants and animals. In the valley of the park you can see the early color changes of the ash, cottonwoods, and Basswoods; moving up the slopes of the highest bluffs of the Des Moines River the forest transitions into an oak forest and eventually into an oak savanna and Prairie. The Prairie within Kilen Woods is filled with a diverse plant community; Blazing Star, Golden Rods, Prairie Smoke, along with Indian Grass and Bluestem make for a beautiful walk in the mornings and evenings.","whereToGo":"Starting from the parking lot of the picnic grounds, a high suggested route is the Sioux Trail. The trail will lead you through the tall grass prairie to the resting bench where you can see the rolling hills of the Des Moines River valley. Continuing onward to the Connector Trail that leads you through the Prairie Bush Clover Scientific and Natural Area leading to the Des Moines River Overlook; this is a good spot to rest and enjoy the view of the valley. Taking the Ox Cart Trail and Meadow Trail will take you through the flood Plaine and low meadow of the park giving visitors a unique chance to see 3 different plant communities during mile and a half walk.g soon..."},{"lat":47.197955,"timestamp":"2021-09-29 11:45:54","alsoOfInterest":"A hike to Corundum Point or up to Day Hill would be well worth your time.","name":"Split Rock Lighthouse","url":"/state_parks/split_rock_lighthouse","whatToSee":"Many species of wildflowers are in bloom including goldenrod, black-eyed susan, pearly everlasting, woodland sunflower and wild asters. Aspen and birch trees are starting to turn yellow throughout the park. The forest understory is looking spectacular. Grouse are fun to see along the roadsides.","whereToGo":"The majority of trees are showing signs of color. Mountain ash trees highlighting their orange berries are beautiful to see along the trails. An inland hike on the Merrill Logging Trail and along the Split Rock River loop are showing bursts of color. ","leaves":"5","grasses":"5","date":"September 29, 2021","photo":"1633008614972","region":"ne","id":"SPK00266","lon":-91.39201,"flowers":"5"},{"lat":44.289678,"timestamp":"2021-09-29 11:28:25","alsoOfInterest":"We have multiple turkey families and a thick deer population roaming the park. A goat heard is munching down invasive species like buckthorn and garlic mustard.  ","whereToGo":"Our campground road and day use areas offer easy access to view the start of changing trees.  ","url":"/state_parks/flandrau","name":"Flandrau","whatToSee":"Our Walnut trees in the park are bare. The maples haven't started to turn yet. The Ash trees are starting to turn yellow. ","leaves":"3","grasses":"2","region":"sw","photo":"1632933455580","date":"September 29, 2021","id":"SPK00145","lon":-94.464957,"flowers":"6"},{"flowers":"5","photo":"1632426068601","date":"September 29, 2021","region":"metro","id":"SPK00100","lon":-92.785066,"leaves":"3","grasses":"6","whatToSee":"We are seeing splashes of leaf color in the oaks, and the maples are really starting to show orange and reds. Sumac and dogwood is displaying crimson color as well, but is not nearly at peak. The park's wildflowers are nearing their peak fall bloom, with goldenrod, blazing star, and asters being found in many areas. Big and little bluestem and Indiangrass are also ripening and you'll find these grasses along many of the park's prairie trails. Pollinators are active among the wildflowers as they prepare for the change of seasons, and waterfowl and migratory songbirds are on the move.","url":"/state_parks/afton","whereToGo":"As we begin to see more leaf colors appearing in the trees, a visit to the park's overlook points is a great way to take in the views of the St. Croix River Valley. The following 3.5 mile loop is a popular favorite: Starting from the end of the main parking lots, continue down toward the river using the paved bike trail or stairway. At the top of the stairway, there is an observation deck offering a nice view of the river valley to the north. When you reach the end of the pavement at the bottom of the hill, take a left and continue north along the North River Trail near the edge of the St. Croix River toward intersection \"T\". From that intersection, begin an uphill climb and once at the top be sure to stop by clearing near intersection \"U\"; this overlook offers a fantastic elevated view of the valley looking to the south. Continuing west and then south from this overlook will eventually bring you through the backpack campground and down the new volunteer-installed trail to the bottom of the hill. There are some nice vistas through the campground, and benches along the new trail to stop to take in the fall colors. ","name":"Afton","alsoOfInterest":"The park's overlook points are great places to take in the beauty of the St. Croix River Valley in the fall.\n\n  If you don't want to get out of your car the trees along the park's main road and parking areas are very colorful. \nSome favorite views to walk to are the observation deck near the middle picnic area, the overlook at the northeast corner of the park near intersection \"U\", and the new habitat management clearings of the south-facing bluff prairies located along the western edge of the prairie loop. \n\nThe cooler temperatures of the fall season provide an excellent opportunity to explore the nearly 20 miles of hiking trails in Afton State Park. Ask a park staff member for route recommendations, or feel free to explore on your own using the recently updated \"you-are-here\" maps and wayfinding markers located at nearly every trail intersection. Avenza maps is useful too.  Ask a staff to help you download it to your phone.","timestamp":"2021-09-29 10:52:01","lat":44.857739},{"lat":47.145192,"timestamp":"2021-09-29 10:32:16","alsoOfInterest":"Grouse are frequently seen along the sides of the trails. Signs of wolves and bears are also common on the trails.  ","whereToGo":"The higher elevations in the northeast section of the park offers large landscape views. The Falls Loop Trails makes for pleasant fall hike. ","url":"/state_parks/gooseberry_falls","whatToSee":"The balsam poplar are past peak, birch trees are nearing peak yellow in several areas of the park. Black ash are now bright yellow. Maples are at peak in the higher elevations surrounding the park and along Lake Superior. The forest understorey is a mix or rustic colors. Moose maples are bright red. The mountain ash are showing their iconic orange berries. ","name":"Gooseberry Falls","grasses":"5","leaves":"5","region":"ne","photo":"1632929412447","date":"September 29, 2021","id":"SPK00172","lon":-91.471724,"flowers":"6"},{"timestamp":"2021-09-29 10:24:52","lat":45.218377,"alsoOfInterest":"Swans and geese have returned to Lake Alice and will visit daily until the lake freezes over. Come early to view morning fog and mist over the water. The stillness of Lake Alice reflects the colors on the hillside. Paddle down the St. Croix to see the contrast of greens on the Wisconsin hillsides and yellows and reds on the Minnesota side.","leaves":"3","grasses":"4","url":"/state_parks/william_obrien","whereToGo":"Day use area and Riverside Trail is best place to see fall change. Eastern and south hillsides have more color than the west and north facing hillsides. Wedge Hill Savanna trail and Prairie Overlook trails are prime with the late summer flowers. Hardwood hill trail are green if you are still longing for summer.","name":"William O'Brien","whatToSee":"Aspen and Maple canopy has muted colors. Oaks are still green. Flowers are at the peak in the prairie land, while grasses continue to turn fall purples and tans.","flowers":"5","lon":-92.777113,"region":"metro","photo":"1633026294704","date":"September 29, 2021","id":"SPK00283"},{"lat":47.917728,"timestamp":"2021-09-29 10:19:58","alsoOfInterest":"Cool morning are the best time to enjoy fall. Start of migrating sparrow. Bald eagles.","name":"Red River","url":"/state_parks/red_river","whereToGo":"Travel along bike trail, and lower hiking trail for best display of fall colors.","whatToSee":"Grasses and wildflowers like Big Bluestem, Switch grass and Goldenrod. Leaves on Cottonwoods are headlining the show. ","grasses":"5","leaves":"4","lon":-97.008362,"photo":"1632929725615","date":"September 29, 2021","id":"SRA00309","region":"nw","flowers":"4"},{"timestamp":"2021-09-29 10:15:19","lat":47.342547,"alsoOfInterest":"Bean and Bear Lake has a wonderful view of Fall Colors right now! ","leaves":"4","grasses":"3","name":"Tettegouche","url":"/state_parks/tettegouche","whereToGo":"All of the overlooks at Tettegouche Camp are offering views of Fall Colors! You can find these overlooks around Tettegouche Lake, Mt. Baldy, and Mt. Trudee! Just to name a few!","whatToSee":"You will see spectacular Fall Colors from these overlooks!","flowers":"4","photo":"1632749462437","id":"SPK00269","date":"September 29, 2021","region":"ne","lon":-91.244033},{"alsoOfInterest":"Take a drive up Temperance River road for the Fall Color Tour! ","lat":47.565537,"timestamp":"2021-09-29 10:15:15","photo":"1631479493998","date":"September 29, 2021","region":"ne","id":"SPK00268","lon":-90.895481,"flowers":"4","url":"/state_parks/temperance_river","name":"Temperance River","whereToGo":"Hike to Carlton Peak at Temperance River State Park. ","whatToSee":"You will see Fall Colors as you hike along the Temperance River Gorge. Once you get to Carlton Peak you will see a spectacular view of Fall Colors and Lake Superior!","leaves":"4","grasses":"3"},{"alsoOfInterest":"Hike the Yellow Birch Trail to the Misquah trail and head up to the overlook at site six. You will see a breathtaking view of the Sawtooth Mountain Range!","timestamp":"2021-09-29 09:52:51","lat":47.47802,"flowers":"4","lon":-91.094669,"region":"ne","photo":"1632928909268","date":"September 29, 2021","id":"SPK00163","grasses":"3","leaves":"4","url":"/state_parks/george_crosby_manitou","name":"George Crosby Manitou","whereToGo":"Bensen Lake hike around the boardwalk is a wonderful hike right now!","whatToSee":"You will see Maple and Birch Fall Colors and enjoy the beautiful scenery! "},{"name":"Zippel Bay","url":"/state_parks/zippel_bay","whereToGo":"Take a walk through the woods on one of our trails, and connect with nature. Or, check out our over 2 miles of white sandy beach on Lake of the Woods for some beautiful views and peace and tranquility. Stop at the marina and look by the boat slips, you might get lucky enough to see some turtles basking in the sun.","whatToSee":"A gorgeous array of colors await you! If you have the chance to see the area with the morning sun coming over the horizon, the leaves and everything glow gold! We have a majority of yellow leaves here, but, there's just enough orange and red coming through to really pop among what's left of the green leaves. A variety of wildlife call the park home, and while out walking you may get lucky enough to see it! From pine martins, porcupine, turtles, frogs, white tailed deer, grouse to much more.  ","grasses":"4","leaves":"5","lon":-94.861094,"photo":"1632926461953","date":"September 29, 2021","id":"SPK00284","region":"nw","flowers":"4","lat":48.86582,"timestamp":"2021-09-29 09:21:21","alsoOfInterest":"Fall fishing is always an excellent pastime on Lake of the Woods! Our park has a boat landing into Zippel Bay that leads right out into Lake of the Woods for your convenience! Too windy on the lake? Fishing in Zippel Bay is always a great option too! Don't have a boat? No problem! We also have two canoes for rent. "},{"flowers":"4","lon":-94.069326,"photo":"1632925912955","date":"September 29, 2021","id":"SPK00157","region":"ne","leaves":"5","grasses":"4","name":"Franz Jevne","url":"/state_parks/franz_jevne","whereToGo":"Follow the path for our hiking club trail to get beautiful views of the Rainy River. \nLooking for a quick walk? Park by the Sault Rapids trail entrance, and it's only a 5 minute walk to the river.","whatToSee":"The park and surrounding area are at peak fall colors currently. There are still some trees holding onto green leaves, but the majority have changed and it all looks beautiful. Along the hiking club trail, you will come across numerous types of mushrooms, fallen leaves crunching under every footstep, gorgeous views of the Rainy River, and have the chance to see a variety of birds. ","alsoOfInterest":"Fall camping is always a great pastime! Franz Jevne offers 2 electrical sites, 2 hike in sites, and 12 non electrical drive-in sites to choose from. Many of the sites offer views of the Rainy River. ","timestamp":"2021-09-29 09:18:40","lat":48.643446},{"lat":46.133965,"timestamp":"2021-09-29 09:05:00","alsoOfInterest":"Visit the park's event page for a schedule of weekend interpretive programs. ","url":"/state_parks/mille_lacs_kathio","whereToGo":"Take a drive along the park's main road to see a variety of fall foliage. ","name":"Mille Lacs Kathio","whatToSee":"The maples are turning beautiful shades of yellow, orange and red. The colors are not at peak but you will not be disappointed. Visit now for variety in the forest. ","grasses":"4","leaves":"4","lon":-93.73607,"photo":"1632924206867","date":"September 29, 2021","id":"SPK00232","region":"nw","flowers":"5"},{"lat":44.054583,"timestamp":"2021-09-29 08:47:16","alsoOfInterest":"We have a full fall line up of programs! Find a schedule of events on the Whitewater State Park webpage.","url":"/state_parks/whitewater","whatToSee":"Look for caves and other geologic features along the cliff faces as the foliage disappears and reveals the underground world.","whereToGo":"Hike Trout Run Creek Trail to see some impressive beaver activity along the creek.","name":"Whitewater","grasses":"4","leaves":"2","date":"September 29, 2021","photo":"1633020401755","id":"SPK00280","region":"se","lon":-92.054308,"flowers":"4"},{"lat":44.676619,"timestamp":"2021-09-29 08:45:47","alsoOfInterest":"","url":"/state_parks/minnesota_valley","name":"Minnesota Valley","whatToSee":"","whereToGo":"Trees are quickly starting to turn throughout the SRA.","grasses":"5","leaves":"3","lon":-93.708773,"region":"metro","photo":"1632329265699","date":"September 29, 2021","id":"SRA00304","flowers":"6"},{"url":"/state_parks/john_latsch","whatToSee":"Some oaks and maples are starting to turn although they aren't showing bright colors. Pelicans, gulls and a variety of waterfowl are moving along the Upper Mississippi River flyway. ","whereToGo":"Hike the Riverview Trail to gain perspective atop Mount Charity.","name":"John A. Latsch","grasses":"4","leaves":"2","photo":"1632923619306","date":"September 29, 2021","id":"SPK00177","region":"se","lon":-91.824649,"flowers":"4","lat":44.162688,"timestamp":"2021-09-29 08:45:27","alsoOfInterest":"Check out naturalist programs at nearby Whitewater State Park."},{"grasses":"4","leaves":"2","url":"/state_parks/carley","whatToSee":"Many walnuts, cottonwoods and ash have lost their leaves. Some maples and oaks are starting to turn. Asters, snakeroot and woodland sunflowers are blooming.","name":"Carley","whereToGo":"Take the Wildflower Trail to explore the floodplain forest along the river. Look up to observe the tall white pines on the cliff above the river.","flowers":"4","photo":"1633020676778","id":"SPK00130","date":"September 29, 2021","region":"se","lon":-92.173982,"timestamp":"2021-09-29 08:43:26","lat":44.115642,"alsoOfInterest":"Check out the naturalist programs at nearby Whitewater State Park."},{"grasses":"2","leaves":"4","url":"/state_parks/st_croix","whatToSee":"The 5ml drive thru the entrance of the park is probably by far one of the prettiest so far for fall color, however the trees are quickly losing their foliage. The smaller trees have lost most of their leaves. A lot of trees throughout the park are turning yellow, and some are still green. ","name":"St. Croix","whereToGo":"5ml entrance thru the park is the most impressive right now for fall color. Hiking trails are still pretty busy during the week and weekends, despite the season coming to a close. Rivers are low but quite calm and lazy which is great for canoeing and kayaking.","flowers":"2","photo":"1632922401260","date":"September 29, 2021","region":"ne","id":"SPK00253","lon":-92.620154,"timestamp":"2021-09-29 08:33:57","lat":45.935151,"alsoOfInterest":"Lots of bear sightings, feeding on acorns and whatever else they can find to fatten up for winter. There have even been some frequent timber wolf sightings as well. Rivers are low, but canoeing & fishing is alive and well. "},{"alsoOfInterest":"Birds are active this time of year! Take a hike along our hiking club trail to hear the pounding of woodpeckers and the chirps of chickadees. Upper Sakatah lake will offer views of double-crested cormorants, pelicans, and blue herons. Let park staff know what you are spotting!","timestamp":"2021-09-29 08:22:56","lat":44.223967,"flowers":"5","lon":-93.527686,"photo":"1633009609333","date":"September 29, 2021","region":"se","id":"SPK00256","grasses":"5","leaves":"3","whereToGo":"Take a break at our picnic area to see views of fall colors across the lake. From the picnic area parking lot, go down a few stairs to a shaded grassy area with multiple picnic tables and fire rings for cooking.","url":"/state_parks/sakatah_lake","name":"Sakatah Lake","whatToSee":"Most trees have yellowing leaves, virginia creeper provides flashes of red amongst the green and yellow. A few maples are starting to redden as well. "},{"alsoOfInterest":"Look on park lakes for groups of trumpeter swans on smaller park lakes. Listen for their deep bugling call and wings slapping on the water?s surface in early morning. Listen for and watch flocks of Canada geese as they fly in V-formation overhead, winging their way south. Flocks of red-winged blackbirds flit through tree branches, feeding as they start to migrate. Gray and red squirrels continue to be active on park roads, scurrying across as they collect pinecones and acorns. Look for the mottled reddish brown-gray coats of white-tailed deer transition to their gray winter coat. Listen for the booming laugh-like call of the pileated woodpeckers. Look and listen for woodducks, mallards, and Canada geese feeding on park lakes at dusk and dawn. Snowshoe hares are moving through brushy areas. Look for the camouflaged ruffed grouse feeding along park trails. Listen for their sharp wing-bursts as they take flight when startled. Porcupines are starting to move about more. Watch for river otters as they swim and play in the backwaters of park lakes. Beaver are active towards dusk swimming on park lakes. Listen for their tail slaps as warnings when they sense danger. Look for signs of their nighttime construction as they cut wetland shrubs to build up lodges, dams and winter food stores. ","lat":47.192609,"timestamp":"2021-09-29 08:16:43","lon":-95.220553,"region":"nw","photo":"1632864350799","date":"September 29, 2021","id":"SPK00181","flowers":"6","url":"/state_parks/itasca","whatToSee":"<B>Trees:</B> Sugar and red maples are quickly moving to peak colors, adding their lovely shades of red, orange and gold. The red maples are stunning as they turn a gorgeous deep red. Look for a soft butter-yellow color in the basswoods as leaves begin to peak. Look for a rich gold this year in the balsam poplar. They are holding their leaves longer this year. Paper birch, trembling and big-tooth aspen are starting to add more yellow and gold tones to the forest mix. Bur oaks are quickly turning a soft camel brown while a more red oaks continue to show deep red-brown and deep wine colored leaves. Some of the tamaracks are beginning to turn gold, a little earlier than past years.\nMaple/Basswood/Ironwood/Ash: Now peaking.                                                                                          Birch/Oak/Aspen: Colors are changing quickly.                                                                                           Tamarack: Little color change, individual trees are gold.  <BR>  \n<b>Shrubs and ground plants:</b> The understory trees and shrubs are popping with color! The small knee-high maples and red oaks have turned color, adding a flush of color to the lower levels. Blue beech leaves have turned a lovely salmon pink color. Willows are beginning to add shades of yellow. Hazel have pretty pinkish-gold colored leaves. Pagoda, gray and red-osier dogwoods are continuing to change color, also displaying a deep purple-mauve color. Staghorn sumac leaves are a deep red, the fuzzy deep red fruit column sticking out from the tops of the shrubs. Look for trees draped in a variety of vines, including soft yellow of riverbank grape and deep red of Virginia creeper clinging to trees. Enjoy the colorful poison ivy leaves from afar. The bright colors attract birds to the drab ivory colored fruits. Birds can eat the poison ivy berries but people cannot.   <BR>\n<b>Flowers:</b> Our fall flowers are wrapping up their season. You can still find Zig-zag goldenrods, with their lovely tones of yellow. Asters are finishing up with blue, purple and lavender flowers along wetlands and lakeshores. The most interesting part of our fall are the colorful fruits that have developed on the shrubs and plants. Look for red, blue, purple, cream and white colored berries. Just remember, not all fruits are edible by humans.  \n","whereToGo":"Fall colors are advancing quickly as most tree species are showing some level of color change. Stunning colors are on display in the sugar and red maples as they begin to peak! Enjoy an early morning drive along the South Entrance Road as the rising sun highlights the vivid colors across the many small lakes along the road. Driving Main Park Drive will highlight the brilliant red maples and stunning sugar maples, golden tones of basswood, balsam poplar and paper birch. Numerous small lakes and wetlands along Wilderness Drive will offer lovely views of the orange, red and golden colors. Views across Mary Lake from either the South Entrance Road or hiking the Mary Lake Trail are pretty as the colors reflect across the water. The Dr. Roberts Trail to catch the color change in a variety of trees. Ozawindib and Deer Park Trails are nice trails for the maple, basswood and oak. Make a longer hiking loop by following Ozawindib, Myrtle Lake Cross-over and Deer Park Trails for views across several lakes and moist pools. Red Pine Trail is a nice trail (make a loop onto Myrtle Lake Crossover and Ozawindib Trail) to enjoy the color change in birch/maple/oak. Following the Brower Trail from Douglas Lodge to Bear Paw Campground will reveal pops of color across the east arm of Lake Itasca. Two Spot and DeSoto Trails will reveal the color changes in aspen and oak. Consider biking the bike trail-Wilderness Drive loop for a 16-mile bicycle fall color tour! Enjoy a sunset tour from your canoe, kayak or boat on Lake Itasca or Mary Lake to enjoy the color reflection on the water. Warm, dry and sunny days are causing fast color change. Depending on the weather, expect peak colors this week and into next week.","name":"Itasca","leaves":"5","grasses":"6"},{"lat":44.345223,"timestamp":"2021-09-29 08:12:39","alsoOfInterest":"Check out the prairie trail to see the golden grasses accented by the changing leaves where the prairie meets the forest.","name":"Nerstrand Big Woods","url":"/state_parks/nerstrand_big_woods","whatToSee":"Leaf color is increasing at the park. We are sitting around the 30 to 35% mark. Hints of red are showing up in the oaks adding to the orange of the maples and yellows of the ash and ironwoods. ","whereToGo":"Hidden Falls Trail continues to offer some of the best leaf color in the park.   ","grasses":"5","leaves":"3","date":"September 29, 2021","photo":"1632922040985","region":"se","id":"SPK00241","lon":-93.111019,"flowers":"6"},{"alsoOfInterest":"Hike from the swimming pond for 0.2 miles on the Dakota Valley trail to the scenic overlook for an excellent view.","timestamp":"2021-09-29 08:11:19","lat":44.352926,"flowers":"6","date":"September 29, 2021","photo":"1632750800019","id":"SPK00127","region":"sw","lon":-95.931239,"leaves":"3","grasses":"5","url":"/state_parks/camden","whatToSee":"The maple/basswood deciduous forest is beginning to show it's fall colors. Light blue to purple asters can be seen along the meandering Redwood River.","name":"Camden","whereToGo":"All of the trails are beautiful this time of year, but I would recommend the River Trail."},{"region":"sw","photo":"1633009003387","date":"September 29, 2021","id":"SPK00197","lon":-95.88959,"flowers":"5","url":"/state_parks/lac_qui_parle","name":"Lac qui Parle","whereToGo":"2021 has been an interesting year for weather.  Some tree and bush leaves are  turning due to drought stress. There are 25,000 plus acres of public land to wander on here at Lac qui Parle State Park and Wildlife Management Area and the upper Minnesota River Valley! Travel the Minnesota River Valley National Scenic Byway for the historic, natural, and cultural intrinsic stories.  Lac qui Parle is known for its birding, hunting, and fishing opportunities. So as fall arrives make sure to be safe and wear orange when you hike out onto the huge expanses of public land in the area.  ","whatToSee":"Lac qui Parle State Park is nestled into a much larger land base along the Minnesota River Valley.  the park itself has floodplain forest, dry hill remnant prairies, reservoir lakes, and some remaining prairie potholes.  Favorite places to view fall colors in the park are the overlook above the east side of Lac qui Parle Lake, the small parking pull off on the west side of the lake above the boat landing in the park, and at the DNR headquarters office where the high density of prairie forbs are an ever changing array of color and pollinators.  ","leaves":"3","grasses":"3","alsoOfInterest":"The Lac qui Parle Mission is open through MEA however is never staffed.  The interpretive panels on site are very interesting about the early life of missionaries and Fort Renville in the area.  Low LqP Lake levels due to gate replacement on the Lac qui Parle (Churchhill) dam are slowly gaining normal summer levels. Canada goose migrations are later than traditionally expected as the geese are leaving Canada later due to field crop changes.  While waterfowl continues to migrate through each fall, there are less gathered at Lac qui Parle than 30 years ago.  Weekday office hours are limited due to staffing vacancies and the best time to find the office open is Friday 1-8 pm, and Saturday /Sunday 8-4pm.  ","lat":45.031702,"timestamp":"2021-09-29 08:10:09"},{"timestamp":"2021-09-29 07:07:10","lat":45.006815,"alsoOfInterest":"A park permit is not required to visit. \nGreenleaf is open to archery deer hunting from September 18-December 31.  ","grasses":"4","leaves":"3","whereToGo":"Starting soon...","url":"/state_parks/greenleaf_lake/index.html","name":"Greenleaf Lake","whatToSee":"","flowers":"4","date":"September 29, 2021","region":"sw","id":"SRA00310","lon":-94.46329},{"leaves":"4","grasses":"5","url":"/state_parks/big_bog","whatToSee":"A variety of colors are emerging around the lake and Tamarac River.  It's surprising how quickly they can change, so plan to climb the tower soon!","name":"Big Bog","whereToGo":"Climb the fire tower for a spectacular view of the shoreline along Upper Red Lake and the Big Bog.","flowers":"6","date":"September 28, 2021","photo":"1632870884268","region":"nw","id":"SRA00308","lon":-94.564996,"timestamp":"2021-09-28 17:30:01","lat":48.238056,"alsoOfInterest":"Take time to enjoy a magnificent sunset over Upper Red Lake at the swimming beach and create a beautiful fall memory with someone special."},{"flowers":"3","lon":-94.118768,"date":"September 28, 2021","photo":"1632866205168","id":"SPK00235","region":"sw","grasses":"2","leaves":"2","name":"Minneopa","url":"/state_parks/minneopa","whereToGo":"Head to the waterfalls area to take a walk down into the gorge and on the bike trail along County Highway 69.","whatToSee":"Sugar and Silver maples are beginning to change their leaf colors, exposing reds, oranges and yellows.","alsoOfInterest":"Take a hike anywhere at Minneopa to see the colorful leaves of the maples and other trees.","timestamp":"2021-09-28 16:57:40","lat":44.171257},{"name":"McCarthy Beach","url":"/state_parks/mccarthy_beach","whatToSee":"The oaks and maples that popped their color early are now bare, but the rest of the trees are quickly changing to their own fall colors. Bright yellows and subtle oranges are prevalent all over the park, with bright reds and oranges scattered throughout as well. Many trees have only started their change but the greens of summer leaves only add beauty to an already unique and stunning fall season.","whereToGo":"Stony Brook Horse Campground and Beatrice Lake Campground continue to lead the change in fall colors throughout the McCarthy Beach managed areas, and they have a new beauty with these later season colors. Side Lake Campground and the interior hiking trails of McCarthy Beach are now awash with beautiful fall colors - any place you go in the park right now will provide its own beautiful variation of this fall season.","leaves":"4","grasses":"5","lon":-93.041586,"photo":"1632860114162","id":"SPK00226","date":"September 28, 2021","region":"ne","flowers":"5","lat":47.694916,"timestamp":"2021-09-28 15:16:53","alsoOfInterest":""},{"alsoOfInterest":"Do a self-guided tour of the Fort Ridgely Historic Site.  A walking path will take you to each of the foundation remnants, with some history lessons along the way.  Beautiful views of prairie areas from here! ","timestamp":"2021-09-28 14:56:48","lat":44.461563,"flowers":"6","lon":-94.730047,"photo":"1632239489452","date":"September 28, 2021","id":"SPK00151","region":"sw","grasses":"5","leaves":"3","url":"/state_parks/fort_ridgely","name":"Fort Ridgely","whereToGo":"The Fort Ridgely Hiking Club trail, which is highlighted on our map, is a great trail to see both wooded and open prairie areas.  Just a few steps off of this trail will take you to two scenic overlooks.","whatToSee":"Recent rains are bringing some of the early leaves down, but still beautiful to hike or bring your horses to ride the trails.  Squirrels are busy gathering nuts, and the deer are grazing in their home habitat.  There are still some pretty fall blooming prairie plants to see.  The campers are enjoying the cooler evenings to sit and relax around a campfire!"},{"timestamp":"2021-09-28 13:25:10","lat":43.707134,"alsoOfInterest":"Ringneck Pheasants ","grasses":"3","leaves":"3","whereToGo":"Hiking Club trail along the group camp area which is in the north side of the park.","url":"/state_parks/blue_mounds","whatToSee":"Leaves gradually turning yellow and sunning snakes. ","name":"Blue Mounds","flowers":"4","photo":"1632255666401","region":"sw","date":"September 28, 2021","id":"SPK00121","lon":-96.192838},{"flowers":"1","photo":"1632847375346","region":"nw","date":"September 28, 2021","id":"SPK00205","lon":-94.81696,"grasses":"1","leaves":"4","whereToGo":"Drive under a canopy of brightly colored leaves along the entrance road; flaming oranges and golden yellows.","url":"/state_parks/lake_bemidji","name":"Lake Bemidji","whatToSee":"Maple, basswood, and birch trees are changing quickly while oak trees are still green. ","alsoOfInterest":"Enjoy the fresh autumn air on a bike ride along the Paul Bunyan State Trail. Bikes are available for rent at the park office.","timestamp":"2021-09-28 11:35:40","lat":47.515291},{"photo":"1632844369563","date":"September 28, 2021","id":"SPK00239","region":"ne","lon":-92.738217,"flowers":"4","whatToSee":"Falling leaves and migrating birds","url":"/state_parks/moose_lake","whereToGo":"Tall Pines Trail for some panoramic views","name":"Moose Lake","leaves":"4","grasses":"4","alsoOfInterest":"Row a boat or paddle a canoe and get fabulous views of all the fall colors on Echo Lake","lat":46.438437,"timestamp":"2021-09-28 11:00:49"},{"region":"sw","photo":"1630508472976","date":"September 28, 2021","id":"SPK00238","lon":-95.273113,"flowers":"3","url":"/state_parks/monson_lake","whereToGo":"Enjoy the cooler fall temps while checking out the Hiking Club Trail for some early fall colors. The Boat Landing has great views of the surrounding forest. ","name":"Monson Lake","whatToSee":"The Oak trees are just starting to show some color. Maples trees are showing orange and red colors. The Ash trees are displaying yellow colors. ","leaves":"3","grasses":"3","alsoOfInterest":"The Monson historic shelter building is a great place to have lunch and view the fall colors. ","lat":45.323377,"timestamp":"2021-09-28 11:00:27"},{"alsoOfInterest":"Sibley State Park's Lake View Campground is currently closed until October 2nd for the Glacial Lakes State Trail construction project. ","timestamp":"2021-09-28 10:55:37","lat":45.322144,"flowers":"4","lon":-95.049892,"date":"September 28, 2021","photo":"1632407147980","region":"sw","id":"SPK00265","grasses":"3","leaves":"3","url":"/state_parks/sibley","name":"Sibley","whereToGo":"Head to Mt. Tom for a panoramic view of the surrounding forest. Hike the Pond View Trail by the Interpretive Center for a mix of prairie grasses, flowers and deciduous trees. The park's beach area provides great views of the forest along Lake Andrew.","whatToSee":"Many of the Maple trees are displaying bright orange and red colors. Ash trees are showing yellow colors. There is still a fair amount of green in the canopy. "},{"lat":48.362449,"timestamp":"2021-09-28 10:22:18","alsoOfInterest":"The day use area provides a wonderful 360 degree view of fall.  The weather continues to be pleasant for a nice picnic or walk in the woods.","name":"Old Mill","url":"/state_parks/old_mill","whatToSee":"The Middle River provides an interesting glimpse into what a riparian looks like as autumn shows the traditional yellows and reds of the season.","whereToGo":"All the trails in the park are a journey into the fall colors. From the woods to the open fields, although a bit muted by the past summer weather, the colors show the majesty of fall.  It is peak fall color viewing time, with roadways and trails showing yellows, reds and muted orange.","leaves":"5","grasses":"5","lon":-96.576211,"date":"September 28, 2021","photo":"1632431011318","region":"nw","id":"SPK00247","flowers":"5"},{"timestamp":"2021-09-28 10:19:25","lat":48.724615,"alsoOfInterest":"Fishing on the lake, a final run in the boat, a walk on the numerous trails, or a nice stroll along the beach and visitor center are all excellent ways to spend a wonderful fall day.","leaves":"5","grasses":"5","whereToGo":"We are almost past peak fall season in the park and the surrounding areas.  An explosion of color can be seen throughout the lake and trails.  Roadways and trails, lake-shores and watchtower vista views all provide an opportunity to witness the majestic beginning of autumn and the colors of fall.","url":"/state_parks/lake_bronson","name":"Lake Bronson","whatToSee":"Oaks, aspens, and other trees are all showing the traditional fall colors, although the past season's weather has impacted the vibrancy of the landscape.  The warm weather during the day has grasses and flowers showing the seasonal colors as well.","flowers":"5","photo":"1632414417105","id":"SPK00208","date":"September 28, 2021","region":"nw","lon":-96.598472},{"whereToGo":"Enjoy a 1.5 mile hike around the Valley Edge trail for wonderful vistas of both the Yellow Medicine and Minnesota River Valleys. ","url":"/state_parks/upper_sioux_agency","whatToSee":"Fall prairie flowers are at or past peak.  With the severe drought this year, leaves are already dropping leaves. Cottonwoods in particular already have a thin canopy. ","name":"Upper Sioux Agency","grasses":"4","leaves":"3","id":"SPK00277","photo":"1632841618769","date":"September 28, 2021","region":"sw","lon":-95.452072,"flowers":"6","lat":44.733916,"timestamp":"2021-09-28 09:59:41","alsoOfInterest":"Hwy 67 is permanently closed within the park boundaries.  Please visit the park webpage for detour information.  "},{"timestamp":"2021-09-28 09:47:22","lat":46.327164,"alsoOfInterest":"Showers on until Oct. 3. Equipment rentals - bikes, watercraft - are available until October 24. Drive-in electric host site will be available to camp in beginning October 4 (call park to reserve).","grasses":"3","leaves":"4","whatToSee":"Maples are turning orange, yellow, and red, especially by the lodge. Ashes and cottonwoods are bright yellow. Sumac are dark red on the prairie.","url":"/state_parks/glendalough","whereToGo":"Wooded trails and lakeshore areas will have the most color. Lodge area will be approaching peak by end of week. ","name":"Glendalough","flowers":"6","lon":-95.666637,"photo":"1632869164626","id":"SPK00167","date":"September 28, 2021","region":"nw"},{"name":"Buffalo River","url":"/state_parks/buffalo_river","whereToGo":"The Prairie View Trail is a great place to see tall grass prairie and changing leaf colors along the river.","whatToSee":"The trees along the river corridor are turning yellow and orange.","grasses":"6","leaves":"5","date":"September 28, 2021","photo":"1632835176450","id":"SPK00124","region":"nw","lon":-96.463297,"flowers":"6","lat":46.86377,"timestamp":"2021-09-28 08:21:13","alsoOfInterest":"The River View Trail is worth a walk to see the Buffalo River and changing leaf colors."},{"leaves":"4","grasses":"6","url":"/state_parks/lake_vermilion_soudan","whatToSee":"Red maples are brilliant right now and the aspen is starting to turn.  Due to recent winds, so trees have already lost their leaves.","name":"Lake Vermilion-Soudan Underground Mine","whereToGo":"The maples are a brilliant red and some of the aspen are turning yellow. Ferns have turned brown.  The hiking club trail is a good way to see the colors when they start changing as it will take you through some towering pines and colorful maple/oak/aspen stands.  The road to Stuntz Bay and the main road through the Lake Vermilion unit are other good spots to view the changing colors.  The drive along Hwy 169 between Soudan and the road to Bear Head Lake State Park is great for colors.","flowers":"6","photo":"1632929492270","date":"September 28, 2021","region":"ne","id":"SPK00285","lon":-92.200613,"timestamp":"2021-09-28 08:14:06","lat":47.831826,"alsoOfInterest":"Underground mine tours are available daily until October 3rd.  Call 218-300-7000 for tour times.  Tours are first come - first served."},{"leaves":"4","grasses":"6","whereToGo":"Climb the hill adjacent to the La Salle Lake picnic area parking lot and sit under a large Sugar Maple tree flaming with autumn color for a birds-eye view of the recreation area. Immerse yourself in the sounds of leaves rustling overhead and watch as leaves float to the ground marking the end of their seasonal journey.","url":"/state_parks/la_salle_lake/index.html","name":"La Salle Lake","whatToSee":"This is a great time to catch maple tree species with the leaves on as they transition into peak fall color. Sugar Maple trees offer a variety of color in citrusy shades of yellow, orange and green. The army green summer leaves of Red Maple trees are turning shades of scarlet. Sumac shrubs are contributing to the red color palate as fruits ripen to deep red and the leaves begin to turn along with maroon-hued Woodbine vines. Leaves of Paper Birch, Basswood and Ash trees are becoming more yellow and dry as they mature through the season. Burr Oak leaves, still predominantly green in color, are beginning to turn a crispy brown. ","flowers":"6","photo":"1632408012369","id":"SRA00311","date":"September 27, 2021","region":"nw","lon":-95.178517,"timestamp":"2021-09-27 16:39:44","lat":47.337503,"alsoOfInterest":""},{"timestamp":"2021-09-27 16:01:18","lat":44.099728,"alsoOfInterest":"There are still campsites and camper cabins available for rent.  Camper cabins can be reserved through the winter months and feature heat and electricity.","leaves":"3","grasses":"4","whereToGo":"It is always a nice time of year to take a walk in the park.  There are few mosquitos this year and the views of the lake are fantastic.","url":"/state_parks/lake_shetek","name":"Lake Shetek","whatToSee":"There are many deer in the park along with a lot of squirrels feasting on acorns to make it through the winter.","flowers":"5","date":"September 27, 2021","photo":"1632880696611","region":"sw","id":"SPK00220","lon":-95.688658},{"flowers":"6","date":"September 27, 2021","photo":"1633013285474","id":"SPK00115","region":"sw","lon":-96.510778,"grasses":"5","leaves":"4","whereToGo":" At the Meadowbrook unit, the prairie and bluebird trails are great hikes to see the tallgrasses and wildflowers.  ","url":"/state_parks/big_stone_lake","name":"Big Stone Lake","whatToSee":"Venture out on the prairie trail to see the monarchs, swallows, deer, turkey, pheasant, and dragonflies all enjoying the prairie. Ash and cottonwood trees are beautiful shades of yellow this Fall.  ","alsoOfInterest":"The Bonanza unit is turning red with hillsides full of sumac.  The wildflowers are also attracting a lot of insect life.  \nThe regional arts Meander is happening October 1-3. Go to  https://artsmeander.com/\nto learn more.  ","timestamp":"2021-09-27 14:30:38","lat":45.384088},{"leaves":"3","grasses":"3","url":"/ohv/trail_detail.html?id=13","whereToGo":"Viewing the park from the Hercules Lookout or the Red Valley trail system show a lot of change already. Come take a ride through the recreation area and take in the views.","name":"Iron Range Off-Highway Vehicle","whatToSee":"Our deciduous trees are quickly changing. While we are not to a full change, we are about halfway there.","flowers":"3","lon":-92.450102,"date":"September 27, 2021","photo":"1632323806059","id":"SRA00305","region":"ne","timestamp":"2021-09-27 12:16:35","lat":47.475316,"alsoOfInterest":""},{"timestamp":"2021-09-27 10:41:44","lat":46.175944,"alsoOfInterest":"","leaves":"4","grasses":"5","url":"/state_parks/banning","name":"Banning","whereToGo":"Take a quick hike out along the kettle river on blueberry slide trail to get great views of the rapids and colors. The inner skunk cabbage is a quieter trail and the best for place for fall colors. Trillium Trail is a great option for maple leaves","whatToSee":"Maples are starting to show their colors with reds and oranges. Colors are sporadic, some areas are still green where others have gorgeous color","flowers":"5","region":"ne","photo":"1632873854914","date":"September 27, 2021","id":"SPK00103","lon":-92.840197},{"photo":"1632755105933","id":"SPK00187","date":"September 27, 2021","region":"ne","lon":-92.351155,"flowers":"5","url":"/state_parks/jay_cooke","whereToGo":"Color is showing throughout the park.","name":"Jay Cooke","whatToSee":"We are approaching peak color. Maples are showing lots of reds and oranges on the top of their crowns, while the crown bottoms are still showing green. Some aspens are yellow while others are still green. Basswoods and ashes are turning yellow. Flowers are at peak to the tail end of peak.","leaves":"4","grasses":"5","alsoOfInterest":"The air is beginning to have a mild version of the scent you would get when laying in a pile of leaves...it definitely feels and looks like fall! We are anticipating large crowds on fall color weekends. If you can visit on a weekday, we will likely have much smaller crowds. ","lat":46.648797,"timestamp":"2021-09-27 09:59:40"},{"grasses":"5","leaves":"4","url":"/state_parks/maplewood","whatToSee":"The fall color parade is fully underway with the sugar maples displaying great color throughout the park. The turn is accelerating with some excellent pockets of vibrant colors. Overall color for leaves is approaching 75%  The ashes continue to display their golden  yellows hues throughout the park. Maples are really showcasing their vibrant reds, oranges, and yellows. Fall colors are now changing at a much quickened pace across this vast landscape of hardwood forests, prairies and lakes. The sumac leaves are particularly bursting with crimson and scarlet color along park roads and woodland edges.\nLook for colorful golds, maroons and ambers of the prairie grasses. Various late summer wildflowers, purple asters, sunflower and goldenrod adding bright colors along the prairie and forest edge. The next few weeks will offer great fall color viewing throughout the park and local area. ","name":"Maplewood","whereToGo":"The Hallaway Hill Overlook trail is spectacular anytime of the year and is an excellent place to climb to grand panoramic views of Maplewood's vast deciduous forest and beautiful lakes and prairies. Enjoy the 4 mile scenic Park Drive for great previews of the coming fall color season. The next two weeks will provide very good fall color watching.","flowers":"5","id":"SPK00229","photo":"1632684143128","date":"September 26, 2021","region":"nw","lon":-95.95125,"timestamp":"2021-09-26 13:44:02","lat":46.517738,"alsoOfInterest":"Fall bird migration is beginning with great locations throughout the park to witness trumpeter swans, ducks, hawks, eagles, herons, cranes and loons."},{"alsoOfInterest":"","lat":47.794384,"timestamp":"2021-09-26 11:22:49","region":"ne","photo":"1632403741461","date":"September 26, 2021","id":"SPK00109","lon":-92.075219,"flowers":"5","whereToGo":"Norberg Lake Loop is a great way to experience Bear Head Lake State Park's massive white and Norway pines, overlooks of Bear Head Lake, and areas of deciduous trees such as maple and aspen.\n","url":"/state_parks/bear_head_lake","name":"Bear Head Lake","whatToSee":"The colorful maples are at PEAK however the aspens and birch are hanging on to their summer greens.  Some wildflowers such as purple large leaf asters, golden goldenrod and white pearly everlasting add a little color to the dry forest floor. Grasses, ferns and shrubs have added a variety of brown hues to the understory.\n","grasses":"6","leaves":"4"},{"alsoOfInterest":"","lat":43.890201,"timestamp":"2021-09-24 16:11:12","lon":-96.367483,"photo":"1632851877790","date":"September 24, 2021","id":"SPK00267","region":"sw","flowers":"3","whatToSee":"New England asters are flowering. Some species of goldenrod are still flowering. Some ash trees are starting to turn yellow.  ","url":"/state_parks/split_rock_creek","whereToGo":"Head to the picnic shelter parking lot and hike south along the lake and over the dam that forms Split Rock Lake.  Then head north through prairie to the historic water tower. From the hill on which the water tower sits over look Lake Split Rock. ","name":"Split Rock Creek","grasses":"3","leaves":"3"},{"lat":46.815956,"timestamp":"2021-09-23 11:23:04","alsoOfInterest":"Savanna Portage State Park typically offers beautiful fall colors due to the Park's tree diversity. When visiting the park to view colors, please keep a few things in mind so that your trip and other's will be safe and enjoyable:\n<li> Please do not park on the side of the road. Park only in designated Parking Lots (found on map). </li>\n<li>Do not exceed the speed limit of 20 mph.</li> \n<li> Vehicle permits are required and can be purchased at Park Headquarters. </li>\n<li> Stop in at Headquarters for current conditions and directions. </li>","url":"/state_parks/savanna_portage","name":"Savanna Portage","whereToGo":"Fall colors are about to peak! The whole spectrum of colors can be seen throughout the park, although the lakeshores are exceptionally more colorful.  A beautiful fall hike is the trek around Loon Lake. This narrow trail winds around the Park's trout lake hugging the shore. On calm days, the lake is the perfect reflecting pool for the fall colors that surround it. Loon Lake is the Park's mutli use, day use area with picnic shelter, swimming beach, and boat rentals. Another great way to see the fall colors is to paddle around the lake and see the sights from the water!","whatToSee":"Just about every species of deciduous tree is changing color. The maples are the star of the show ranging from yellow, to a predominant peachy orange, and even bright and dark red. The oaks are still mostly green with a few fading to orange and brown. The aspen trees vary, some have even lost their leaves. Ash are vibrant yellow and basswoods are starting to change from green to yellow, as well. There are still a few fall blooms on the trails, aster and goldenrod, and wildlife are busy preparing for winter (especially the beaver!)","leaves":"4","grasses":"5","lon":-93.170033,"photo":"1632870015388","date":"September 23, 2021","id":"SPK00259","region":"ne","flowers":"5"},{"leaves":"4","grasses":"4","url":"/state_parks/hayes_lake","name":"Hayes Lake","whatToSee":"Whether you are hiking for the fall colors or if you are a birder, there are many different species of birds that you can find along the colorful trails and the lake.","whereToGo":"Our overlooks along Hayes Lake are a great way to enjoy the fall colors as you hike along our many miles of trails. ","flowers":"4","id":"SPK00174","photo":"1631919556803","date":"September 22, 2021","region":"nw","lon":-95.533349,"timestamp":"2021-09-22 13:58:19","lat":48.626688,"alsoOfInterest":""},{"url":"/state_parks/forestville_mystery_cave","name":"Forestville/Mystery Cave","whereToGo":"Overlook Trail and Sandback Trail","whatToSee":"The beginnings of fall has begun to show along the Sandback Trail in the Walnut Trees. At the Overlook trail stopping on the Overlook point allows a breath taking view of the park still painted in vivid greens with just the splash of yellows to show that fall has begun.","grasses":"1","leaves":"1","photo":"1632256571657","date":"September 13, 2021","id":"SPK00148","region":"se","lon":-92.252442,"flowers":"1","lat":43.630879,"timestamp":"2021-09-13 16:33:57","alsoOfInterest":"The picnic areas and camp grounds also have begin the slight change from their vibrant greens to the breath taking oranges and reds."}]}}